{"data":{"site":{"siteMetadata":{"title":"Steve Frost – Front-End Engineer","author":"Steve Frost"}},"markdownRemark":{"id":"d08faadb-e500-5f8e-853c-6fa3a5178dc1","html":"<p><img src=\"/img/blogs/flexboxandgrid1.jpg\" alt=\"flexbox-and-grid-picture\"></p>\n<p>There’s no limit to the choices of <a href=\"http://cssdb.co/\">CSS frameworks and libraries</a>. For years it was a personal preference between ones like <a href=\"https://getbootstrap.com/\">Bootstrap</a> and <a href=\"http://foundation.zurb.com/\">Foundation</a> but recently there has been emerging support for FlexBox which is currently supported by a few frameworks. There hasn’t been a surge of popularity purely because of Flexbox for these options but it has started to make ones that don’t support Flexbox as old-school and outdated.</p>\n<h3>What is Flexbox?</h3>\n<p><a href=\"https://www.w3schools.com/css/css3_flexbox.asp\">Flexbox</a> is a way to organize elements on a web page using several techniques and generally concerning equal distribution across the page regardless of screen size. At it’s base, it is a CSS value of the property <code>display</code>. Flexbox also offers alternate, supporting properties such as <code>flex-flow</code> and <code>flex-direction</code> to dictate what direction your content will condense into as the screen size shrinks. It was created to be an iteration on the common grid system made popular by Bootstrap that is meant to be more straightforward while also being more accommodating to different layouts.</p>\n<h3>Flexbox vs Grid</h3>\n<ol>\n<li>Grid system elements are only concerned with positioning from left-to-right. Once a breakpoint is reached, the components collapse into a single column. Flexbox on the other hand is aware of both the left-to-right as well as the top-to-bottom of it’s parent container.</li>\n<li>There are several sub-properties that assist the flex property compared to grid systems which are based on breakpoints.</li>\n<li>Flexbox can ‘flex’ in size to fit the overall size of their parent div whereas grid systems resize the div itself and cannot adjust children.</li>\n</ol>\n<h3>Continuous Post</h3>\n<p>Since Flexbox is new, this post will be evolving as specifications are rolled out and frameworks accept the new standard. Bootstrap v4 should be out soon and will <a href=\"https://v4-alpha.getbootstrap.com/utilities/flexbox/\">move from the grid system to this new Flexbox spec</a>. If you’re curious about the Flexbox feature, <a href=\"https://css-tricks.com/snippets/css/a-guide-to-flexbox/\">CSS Tricks has great information</a>.</p>","frontmatter":{"title":"Comparing Flexbox and Grid","date":"April 03, 2017"}}},"pageContext":{"slug":"/articles/comparing-flexbox-and-grid/"}}