{"data":{"site":{"siteMetadata":{"title":"Steve Frost – Front-End Engineer","author":"Steve Frost"}},"markdownRemark":{"id":"39876ae4-333e-5690-abf7-a781efab4b11","html":"<p>Although Gatsby.js has been around the static-site generator scene for awhile now, but has recently come to age with a <a href=\"https://www.gatsbyjs.org/blog/gatsby-v1/\">v1 launch</a> and explosion of popularity.</p>\n<h3>Structure</h3>\n<p>My experience early on with Gatsby left me yearning for me as far as structure is concerned. With the v1 launch, the team on the project decided to follow a similar build structure to Gulp &#x26; Grunt common setups where there is separation between the source and public/build. </p>\n<h3>How it works</h3>\n<p>Since each Gatsby project has this separation, it allows us to edit dynamic content &#x26; use dev tools in our source folder &#x26; have Gatsby transform it into flat, static files that can be served from <a href=\"https://pages.github.com/\">GitHub Pages</a>, <a href=\"https://aws.amazon.com/s3/\">S3</a>, or <a href=\"https://surge.sh/\">Surge</a> – very similar to other static site generators. One big difference between other popular options like Jekyll, outside of being JS, is that Gatsby loads all pages on initial load to make subsequent loads quicker. This logic is something that I’m still studying and is one trait that made not only Gatsby super popular, but in a zoomed out picture, React as a whole.</p>\n<h3>Customization</h3>\n<p>If you’re comfortable in a React or JS environment, you’ll be right at home with customization. To set or tweak settings, Gatsby has a <code>gatsby-config</code> file that is a simple JSON file. For example, here is mine.</p>\n<pre><code class=\"language-javascript\">module.exports = {\n  siteMetadata: {\n    title: \"Steve Frost – Full Stack Web Developer\",\n    author: \"Steve Frost\",\n  },\n  plugins: [\n    {\n      resolve: `gatsby-source-filesystem`,\n      options: {\n        path: `${__dirname}/src/pages`,\n        name: \"pages\",\n      },\n    },\n    `gatsby-transformer-sharp`,\n    `gatsby-plugin-sharp`,\n  ],\n}\n</code></pre>\n<p>Simple! To add a plugin, we can yarn/npm install and add to our <code>gatsby-config</code> file.</p>\n<h3>Conclusion</h3>\n<p>So far, so good. I really like Gatsby because of it’s simplicity and also because working with it on personal projects is a great way to complete jobs while also learning more about the most popular emerging JS framework, React. I hope to continue to build this website up from the starter template piece-by-piece so that I understand how Gatsby fundamentally works.</p>","frontmatter":{"title":"First Impressions: Gatsby.js","date":"July 24, 2017"}}},"pageContext":{"slug":"/articles/first-impressions-gatsby-js/"}}